# Meta - Facebook Marketplace Item Price Analyses

In [1]:
import pandas as pd
import numpy as np

In [16]:
df_listing = pd.read_csv('Data/018/listings.csv')
df_listing.head()

   listing_id     category  price           city  user_id
0           1  Electronics    150       New York      101
1           2  Electronics    120  San Francisco      102
2           3    Furniture    300       New York      103
3           4    Furniture    250    Los Angeles      104
4           5     Clothing     50    Los Angeles      105

# Pregunta 1

### ¿Puedes encontrar el precio promedio de los artículos listados en cada categoría en Facebook Marketplace? Queremos entender las tendencias de precios en las diferentes categorías.

In [14]:
df_category_price = df_listing.groupby('category', as_index=False)['price'].mean()

df_category_price

      category  price
0     Clothing   60.0
1  Electronics  150.0
2    Furniture  300.0

```SQL
SELECT
    category,
    avg(price) AS avg_price
FROM Listings
GROUP BY category ;
```

# Pregunta 2

### ¿Qué ciudad tiene el precio promedio más bajo? Esto nos ayudará a identificar las ciudades más asequibles (baratas) para los compradores.

In [19]:
df_city = df_listing.groupby('city')['price'].mean().reset_index()

respuesta2 = df_city.sort_values(by='price', ascending=True).head(1)

respuesta2

          city  price
0  Los Angeles  160.0

```SQL
SELECT
    city,
    avg(price) AS avg_price_city
FROM Listings
GROUP BY city
ORDER BY avg_price_city ASC
LIMIT 1;
```